"""
1) Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента.
Использовать функцию type() для проверки типа. Элементы списка
можно не запрашивать у пользователя, а указать явно, в программе.
"""
my_name = "Елена"
age = 44
height = 1.64
game_over = True
my_list = ["Имя", "Возраст", "Рост"]

print(type(my_name))
print(type(age))
print(type(height))
print(type(game_over))
print(type(my_list))
